espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG21/Include/efr32mg21_prs.h
/* Bit fields for PRS CONSUMER_SE_TAMPERSRC3 */
#define _PRS_CONSUMER_SE_TAMPERSRC3_RESETVALUE               0x00000000UL                                      /**< Default value for PRS_CONSUMER_SE_TAMPERSRC3*/
#define _PRS_CONSUMER_SE_TAMPERSRC3_MASK                     0x0000000FUL                                      /**< Mask for PRS_CONSUMER_SE_TAMPERSRC3         */
#define _PRS_CONSUMER_SE_TAMPERSRC3_PRSSEL_SHIFT             0                                                 /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_SE_TAMPERSRC3_PRSSEL_MASK              0xFUL                                             /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_SE_TAMPERSRC3_PRSSEL_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for PRS_CONSUMER_SE_TAMPERSRC3 */
#define PRS_CONSUMER_SE_TAMPERSRC3_PRSSEL_DEFAULT            (_PRS_CONSUMER_SE_TAMPERSRC3_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_SE_TAMPERSRC3*/

/* Bit fields for PRS CONSUMER_SE_TAMPERSRC4 */
#define _PRS_CONSUMER_SE_TAMPERSRC4_RESETVALUE               0x00000000UL                                      /**< Default value for PRS_CONSUMER_SE_TAMPERSRC4*/
#define _PRS_CONSUMER_SE_TAMPERSRC4_MASK                     0x0000000FUL                                      /**< Mask for PRS_CONSUMER_SE_TAMPERSRC4         */
#define _PRS_CONSUMER_SE_TAMPERSRC4_PRSSEL_SHIFT             0                                                 /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_SE_TAMPERSRC4_PRSSEL_MASK              0xFUL                                             /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_SE_TAMPERSRC4_PRSSEL_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for PRS_CONSUMER_SE_TAMPERSRC4 */
#define PRS_CONSUMER_SE_TAMPERSRC4_PRSSEL_DEFAULT            (_PRS_CONSUMER_SE_TAMPERSRC4_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_SE_TAMPERSRC4*/

/* Bit fields for PRS CONSUMER_SE_TAMPERSRC5 */
#define _PRS_CONSUMER_SE_TAMPERSRC5_RESETVALUE               0x00000000UL                                      /**< Default value for PRS_CONSUMER_SE_TAMPERSRC5*/
#define _PRS_CONSUMER_SE_TAMPERSRC5_MASK                     0x0000000FUL                                      /**< Mask for PRS_CONSUMER_SE_TAMPERSRC5         */
#define _PRS_CONSUMER_SE_TAMPERSRC5_PRSSEL_SHIFT             0                                                 /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_SE_TAMPERSRC5_PRSSEL_MASK              0xFUL                                             /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_SE_TAMPERSRC5_PRSSEL_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for PRS_CONSUMER_SE_TAMPERSRC5 */
#define PRS_CONSUMER_SE_TAMPERSRC5_PRSSEL_DEFAULT            (_PRS_CONSUMER_SE_TAMPERSRC5_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_SE_TAMPERSRC5*/

/* Bit fields for PRS CONSUMER_SE_TAMPERSRC6 */
#define _PRS_CONSUMER_SE_TAMPERSRC6_RESETVALUE               0x00000000UL                                      /**< Default value for PRS_CONSUMER_SE_TAMPERSRC6*/
#define _PRS_CONSUMER_SE_TAMPERSRC6_MASK                     0x0000000FUL                                      /**< Mask for PRS_CONSUMER_SE_TAMPERSRC6         */
#define _PRS_CONSUMER_SE_TAMPERSRC6_PRSSEL_SHIFT             0                                                 /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_SE_TAMPERSRC6_PRSSEL_MASK              0xFUL                                             /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_SE_TAMPERSRC6_PRSSEL_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for PRS_CONSUMER_SE_TAMPERSRC6 */
#define PRS_CONSUMER_SE_TAMPERSRC6_PRSSEL_DEFAULT            (_PRS_CONSUMER_SE_TAMPERSRC6_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_SE_TAMPERSRC6*/

/* Bit fields for PRS CONSUMER_SE_TAMPERSRC7 */
#define _PRS_CONSUMER_SE_TAMPERSRC7_RESETVALUE               0x00000000UL                                      /**< Default value for PRS_CONSUMER_SE_TAMPERSRC7*/
#define _PRS_CONSUMER_SE_TAMPERSRC7_MASK                     0x0000000FUL                                      /**< Mask for PRS_CONSUMER_SE_TAMPERSRC7         */
#define _PRS_CONSUMER_SE_TAMPERSRC7_PRSSEL_SHIFT             0                                                 /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_SE_TAMPERSRC7_PRSSEL_MASK              0xFUL                                             /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_SE_TAMPERSRC7_PRSSEL_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for PRS_CONSUMER_SE_TAMPERSRC7 */
#define PRS_CONSUMER_SE_TAMPERSRC7_PRSSEL_DEFAULT            (_PRS_CONSUMER_SE_TAMPERSRC7_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_SE_TAMPERSRC7*/

/* Bit fields for PRS CONSUMER_CORE_CTIIN0 */
#define _PRS_CONSUMER_CORE_CTIIN0_RESETVALUE                 0x00000000UL                                    /**< Default value for PRS_CONSUMER_CORE_CTIIN0  */
#define _PRS_CONSUMER_CORE_CTIIN0_MASK                       0x0000000FUL                                    /**< Mask for PRS_CONSUMER_CORE_CTIIN0           */
#define _PRS_CONSUMER_CORE_CTIIN0_PRSSEL_SHIFT               0                                               /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_CORE_CTIIN0_PRSSEL_MASK                0xFUL                                           /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_CORE_CTIIN0_PRSSEL_DEFAULT             0x00000000UL                                    /**< Mode DEFAULT for PRS_CONSUMER_CORE_CTIIN0   */
#define PRS_CONSUMER_CORE_CTIIN0_PRSSEL_DEFAULT              (_PRS_CONSUMER_CORE_CTIIN0_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_CORE_CTIIN0*/

/* Bit fields for PRS CONSUMER_CORE_CTIIN1 */
#define _PRS_CONSUMER_CORE_CTIIN1_RESETVALUE                 0x00000000UL                                    /**< Default value for PRS_CONSUMER_CORE_CTIIN1  */
#define _PRS_CONSUMER_CORE_CTIIN1_MASK                       0x0000000FUL                                    /**< Mask for PRS_CONSUMER_CORE_CTIIN1           */
#define _PRS_CONSUMER_CORE_CTIIN1_PRSSEL_SHIFT               0                                               /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_CORE_CTIIN1_PRSSEL_MASK                0xFUL                                           /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_CORE_CTIIN1_PRSSEL_DEFAULT             0x00000000UL                                    /**< Mode DEFAULT for PRS_CONSUMER_CORE_CTIIN1   */
#define PRS_CONSUMER_CORE_CTIIN1_PRSSEL_DEFAULT              (_PRS_CONSUMER_CORE_CTIIN1_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_CORE_CTIIN1*/

/* Bit fields for PRS CONSUMER_CORE_CTIIN2 */
#define _PRS_CONSUMER_CORE_CTIIN2_RESETVALUE                 0x00000000UL                                    /**< Default value for PRS_CONSUMER_CORE_CTIIN2  */
#define _PRS_CONSUMER_CORE_CTIIN2_MASK                       0x0000000FUL                                    /**< Mask for PRS_CONSUMER_CORE_CTIIN2           */
#define _PRS_CONSUMER_CORE_CTIIN2_PRSSEL_SHIFT               0                                               /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_CORE_CTIIN2_PRSSEL_MASK                0xFUL                                           /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_CORE_CTIIN2_PRSSEL_DEFAULT             0x00000000UL                                    /**< Mode DEFAULT for PRS_CONSUMER_CORE_CTIIN2   */
#define PRS_CONSUMER_CORE_CTIIN2_PRSSEL_DEFAULT              (_PRS_CONSUMER_CORE_CTIIN2_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_CORE_CTIIN2*/

/* Bit fields for PRS CONSUMER_CORE_CTIIN3 */
#define _PRS_CONSUMER_CORE_CTIIN3_RESETVALUE                 0x00000000UL                                    /**< Default value for PRS_CONSUMER_CORE_CTIIN3  */
#define _PRS_CONSUMER_CORE_CTIIN3_MASK                       0x0000000FUL                                    /**< Mask for PRS_CONSUMER_CORE_CTIIN3           */
#define _PRS_CONSUMER_CORE_CTIIN3_PRSSEL_SHIFT               0                                               /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_CORE_CTIIN3_PRSSEL_MASK                0xFUL                                           /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_CORE_CTIIN3_PRSSEL_DEFAULT             0x00000000UL                                    /**< Mode DEFAULT for PRS_CONSUMER_CORE_CTIIN3   */
#define PRS_CONSUMER_CORE_CTIIN3_PRSSEL_DEFAULT              (_PRS_CONSUMER_CORE_CTIIN3_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_CORE_CTIIN3*/

/* Bit fields for PRS CONSUMER_CORE_M33RXEV */
#define _PRS_CONSUMER_CORE_M33RXEV_RESETVALUE                0x00000000UL                                     /**< Default value for PRS_CONSUMER_CORE_M33RXEV */
#define _PRS_CONSUMER_CORE_M33RXEV_MASK                      0x0000000FUL                                     /**< Mask for PRS_CONSUMER_CORE_M33RXEV          */
#define _PRS_CONSUMER_CORE_M33RXEV_PRSSEL_SHIFT              0                                                /**< Shift value for PRS_PRSSEL                  */
#define _PRS_CONSUMER_CORE_M33RXEV_PRSSEL_MASK               0xFUL                                            /**< Bit mask for PRS_PRSSEL                     */
#define _PRS_CONSUMER_CORE_M33RXEV_PRSSEL_DEFAULT            0x00000000UL                                     /**< Mode DEFAULT for PRS_CONSUMER_CORE_M33RXEV  */
#define PRS_CONSUMER_CORE_M33RXEV_PRSSEL_DEFAULT             (_PRS_CONSUMER_CORE_M33RXEV_PRSSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for PRS_CONSUMER_CORE_M33RXEV*/

